
SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `tcim_mer_account`
-- ----------------------------
DROP TABLE IF EXISTS `tcim_mer_account`;
CREATE TABLE `tcim_mer_account` (
  `ACCT_ID` int(20) NOT NULL AUTO_INCREMENT COMMENT '账户ID',
  `ACCT_CODE` varchar(40) NOT NULL COMMENT '交易账户号',
  `MER_CODE` varchar(40) NOT NULL COMMENT '商户号',
  `ACCT_NAME` varchar(256) NOT NULL COMMENT '交易账户名',
  `CURRENCY` varchar(8) NOT NULL COMMENT '币种_156：人民币',
  `BANK_CODE` varchar(40) NOT NULL COMMENT '开户银行',
  `BANK_NAME` varchar(256) NOT NULL COMMENT '开户银行名称',
  `BANK_KEY` varchar(40) NOT NULL COMMENT '银行联行号',
  `BRANCH_CODE` varchar(40) NOT NULL COMMENT '分行编号_开户行编号',
  `BRANCH_NAME` varchar(256) NOT NULL COMMENT '分行名称_开户行名称',
  `BANK_ACCT_NO` varchar(40) NOT NULL COMMENT '商户银行账号',
  `BANK_ACCT_NAME` varchar(256) NOT NULL COMMENT '商户银行户名',
  `STATUS` varchar(8) DEFAULT NULL COMMENT '版本状态_1:审核中 2:有效 3:无效',
  `MODIFY_BY` varchar(10) DEFAULT NULL COMMENT '修改人',
  `MODIFY_TIME` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  PRIMARY KEY (`ACCT_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=2000002555 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tcim_mer_account
-- ----------------------------
INSERT INTO tcim_mer_account VALUES ('2000002494', '1000720019', '100072', '开发环境Q0-0423', '156', '1100', '中国农业银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:10');
INSERT INTO tcim_mer_account VALUES ('2000002495', '1000730018', '100073', '开发环境R0-0423', '156', '1100', '中国建设银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:11');
INSERT INTO tcim_mer_account VALUES ('2000002496', '1020550016', '100074', '开发环境S0-0423', '156', '1107', '交通银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:12');
INSERT INTO tcim_mer_account VALUES ('2000002497', '1000750016', '100075', '开发环境T0-0423', '156', '1100', '中国工商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:12');
INSERT INTO tcim_mer_account VALUES ('2000002499', '1000770014', '100077', '开发环境R1-0423', '156', '1100', '中国工商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:14');
INSERT INTO tcim_mer_account VALUES ('2000002500', '1000780013', '100078', '开发环境S1-0423', '156', '1100', '中国工商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:14');
INSERT INTO tcim_mer_account VALUES ('2000002501', '1020550016', '100079', '开发环境T1-0423', '156', '1100', '中国工商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:15');
INSERT INTO tcim_mer_account VALUES ('2000002502', '1000800019', '100080', '开发环境Q05-0423', '156', '1100', '中国银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:16');
INSERT INTO tcim_mer_account VALUES ('2000002503', '1020550016', '100081', '开发环境R05-0423', '156', '1106', '中国银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:17');
INSERT INTO tcim_mer_account VALUES ('2000002504', '1000820017', '100082', '开发环境S05-0423', '156', '1100', '中国银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:18');
INSERT INTO tcim_mer_account VALUES ('2000002505', '1000830016', '100083', '开发环境T05-0423', '156', '1100', '中国银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:19');
INSERT INTO tcim_mer_account VALUES ('2000002542', '1000840015', '100084', '开发环境Q0-0427', '156', '1100', '中国银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:20');
INSERT INTO tcim_mer_account VALUES ('2000002543', '1020550016', '100085', '开发环境R0-0427', '156', '1105', '中国邮政储蓄银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:20');
INSERT INTO tcim_mer_account VALUES ('2000002544', '1000860013', '100086', '开发环境S0-0427', '156', '1100', '中国工商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:21');
INSERT INTO tcim_mer_account VALUES ('2000002545', '1000870012', '100087', '开发环境T0-0427', '156', '1100', '招商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:22');
INSERT INTO tcim_mer_account VALUES ('2000002546', '1000880011', '100088', '开发环境Q1-0427', '156', '1100', '兴业银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:23');
INSERT INTO tcim_mer_account VALUES ('2000002547', '1020550016', '100089', '开发环境R1-0427', '156', '1104', '光大银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:24');
INSERT INTO tcim_mer_account VALUES ('2000002548', '1000900017', '100090', '开发环境S1-0427', '156', '1100', '平安银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:24');
INSERT INTO tcim_mer_account VALUES ('2000002549', '1020550016', '100091', '开发环境T1-0427', '156', '1103', '华夏银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:25');
INSERT INTO tcim_mer_account VALUES ('2000002550', '1000920015', '100092', '开发环境Q05-0427', '156', '1100', '广发银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:26');
INSERT INTO tcim_mer_account VALUES ('2000002551', '1020550016', '100093', '开发环境R05-0427', '156', '1102', '浦发银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:27');
INSERT INTO tcim_mer_account VALUES ('2000002552', '1000950012', '100095', '开发环境S05-0427', '156', '1100', '北京银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:28');
INSERT INTO tcim_mer_account VALUES ('2000002553', '1020550016', '100094', '开发环境T05-0427', '156', '1101', '南京银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:28');
INSERT INTO tcim_mer_account VALUES ('2000002554', '1009760040', '100976', '开发环境T05-0427', '156', '1100', '浙商银行', '11', '1111', '龙华分行', '11111', '1111', '2', 'admin', '2016-09-09 11:49:33');
